[
  {
  "id": 1,
  "description": "Exceptionally well organized; strong work ethics and willingness to work hard to achieve employer objectives."
  },
  {
  "id": 2,
  "description": "Fluent in PC, Mac and other cloud based development and testing environment."
  },
  {
  "id": 3,
  "description": "Certified in computer programming, graphics, audio, animation and web design."
  },
  {
  "id": 4,
  "description": "Abundant experience applying graphic design principles to produce innovative and tastefully documents and web sites cross browsers and platforms."
  },
  {
  "id": 5,
  "description": "High Efficiency in using <em class='highlight'>Adobe Creative Suite 5.5</em> including <em class='highlight'>Photoshop, Flash, Captivate, Dream Weaver, Premiere Pro, Audition, Media Encoder</em> and other commonly used tools related to Front-End design and development."
  },
  {
  "id": 6,
  "description": "Advanced training and experience in the application and usage of tools/game engines such as <em class='highlight'>Microsoft Office, Visual Studio 2010, Eclipse, Sublime Text, Xcode, Maya, 3Ds Max, Unity, XNA, Neverwinter Nights 2,</em> and <em class='highlight'>Unreal 3</em> etc."
  },
  {
  "id": 7,
  "description": "Experienced with <em class='highlight'>Java, C++, C#, ActionScript 2.0, 3.0, JavaScript, JQuery, AJAX, Objective C, ASP.net , JSP</em> and <em class='highlight'>SQL</em> skills related to template constructing. Strong skills in understanding web related coding languages in general."
  },
  {
  "id": 8,
  "description": "Effective skills in <em class='highlight'>Cross-Browser design/Responsive Web Design using CSS, HTML, CSS3, HTML5, SASS, Compass, LESS.</em> Strong abilities in fast prototyping for proofing of concept."
  },
  {
  "id": 9,
  "description": "Experienced with media encoding, Section 508 Compliance for various platforms, web tracking  and marketing using <em class='highlight'>Google Analytics, Omniture, Test&Target</em> and development within variety of content management systems."
  },
  {
  "id": 10,
  "description": "Big fan of trending web ideas, technologies and tools. Familiar with and working on to learn more about: <em class='highlight'>RWD, Git, CoffeeScript, backbone.js, DivShot, Codenvy IDE, Fluid UI, Chrome Remote Desktop</em> and <em class='highlight'>Evernote</em> etc."
  },
  {
  "id": 11,
  "description": "US Citizenship."
  }
]